Revit 2024 API
SolidUtils Members
The SolidUtils type exposes the following members.
Methods
Name | Description
Clone
 Creates a new Solid which is a copy of the input Solid.
CreateTransformed
 Creates a new Solid which is the transformation of the input Solid.
FindAllEdgeEndPointsAtVertex
 Find all EdgeEndPoints at a vertex identified by the input EdgeEndPoint.
IsValidForTessellation
 Tests if the input solid or shell is valid for tessellation.
SplitVolumes
 Splits a solid geometry into several separate solids.
TessellateSolidOrShell
 This function facets (i.e., triangulates) a solid or an open shell. Each boundary component of the solid or shell is represented by a single triangulated structure.
See Also
SolidUtils Class
Autodesk.Revit.DB Namespace